<template>
    <router-view></router-view>
</template>
<script>
    export default {
      //该组件用于支持无限层级菜单，但路由只有两级的情况
      //  存在多级菜单时，一级菜单组件使用Layout，最后一级菜单使用具体业务组件，中间层级的使用Transition组件
      //  用于支持无限层级菜单，但路由只有两级的情况，效果如下
      //
      //   /user/test/foo                     /user/foo/posts
      // +-------------------+                  +-----------------+
      // | Layout            |                  | Layout          |
      // | +---------------+ |                  | +-------------+ |
      // | |transition     | |  +------------>  | | foo         | |
      // | | +------------+| |                  | |             | |
      // | | | foo        || |                  | |             | |
      // | +---------------+ |                  | +-------------+ |
      // +-------------------+                  +-----------------+
    }
</script>